const fs = require('fs');

module.exports = async (m, { pushname, prefix, neo }) => { const fullMessage = `
┌───〔 ʙᴏᴛ ᴡʜᴀᴛsᴀᴘᴘ : ᴀʟʟ ᴍᴇɴᴜ 〕
│
│┌─⊷ ᴀɪ ᴍᴇɴᴜ
││ • .ᴀɪɴᴇᴏ
││ • .ᴀɪ
││ • .ᴀsᴋɢᴘᴛ
││ • .ᴀɪ-ᴀʀᴛ
││ • .ᴀɴɪᴍᴇ-ᴘʀᴏᴍᴛ
││ • .ɢᴘᴛ
││ • .ɢᴍɪᴍɢ
││ • .ʜᴏsʜɪɴᴏ
││ • .ʟᴜᴍɪɴᴀɪ
│└──────────────────
│
│┌─⊷ ʀᴇsᴇʟʟᴇʀ sʏsᴛᴇᴍ
││ • .ᴀᴅᴅsᴇʟʟᴇʀsᴄ
││ • .ᴅᴇʟsᴇʟʟᴇʀsᴄ
││ • .ʟɪsᴛsᴇʟʟᴇʀsᴄ
│└──────────────────
│
│┌─⊷ sᴄ ᴍᴀɴᴀɢᴇʀ
││ • .ᴄʀᴇᴀᴛᴇsᴄ
││ • .ᴀᴅᴅғɪᴛᴜʀ
││ • .ᴅᴇʟғɪᴛᴜʀ
││ • .ʟɪsᴛғɪᴛᴜʀ
││ • .ɢᴇᴛᴄᴀsᴇsᴄ
│└──────────────────
│
│┌─⊷ ᴘᴀɴᴇʟ ᴍᴀɴᴀɢᴇʀ ᴠ1
││ • .1ɢʙ - .10ɢʙ
││ • .ᴜɴʟɪ
││ • .ᴀᴅᴅᴀᴋsᴇs
││ • .ᴅᴇʟᴀᴋsᴇs
││ • .ʟɪsᴛᴀᴋsᴇs
││ • .ᴅᴇʟᴜsᴇʀ
││ • .ʟɪsᴛᴘᴀɴᴇʟ
││ • .ᴅᴇʟᴘᴀɴᴇʟ
││ • .ᴄʟᴇᴀʀᴘᴀɴᴇʟ
││ • .ᴄᴀᴅᴍɪɴ
││ • .ᴅᴇʟᴀᴅᴍɪɴ
││ • .ʟɪsᴛᴀᴅᴍɪɴ
│└───────────────
│
│┌─⊷ ᴘᴀɴᴇʟ ᴍᴀɴᴀɢᴇʀ ᴠ2
││ • .1ɢʙ-ᴠ2 - .10ɢʙ-ᴠ2
││ • .ᴜɴʟɪ-ᴠ2
││ • .ᴀᴅᴅᴀᴋsᴇs-ᴠ2
││ • .ᴅᴇʟᴀᴋsᴇs-ᴠ2
││ • .ʟɪsᴛᴀᴋsᴇs-ᴠ2
││ • .ᴅᴇʟᴜsᴇʀ-ᴠ2
││ • .ʟɪsᴛᴘᴀɴᴇʟ-ᴠ2
││ • .ᴅᴇʟᴘᴀɴᴇʟ-ᴠ2
││ • .ᴄʟᴇᴀʀᴘᴀɴᴇʟ-ᴠ2
││ • .ᴄᴀᴅᴍɪɴ-ᴠ2
││ • .ᴅᴇʟᴀᴅᴍɪɴ-ᴠ2
││ • .ʟɪsᴛᴀᴅᴍɪɴ-ᴠ2
│└───────────────
│
│┌─⊷ ʙᴏᴛ ᴄᴏɴᴛʀᴏʟ
││ • .ʙᴀᴄᴋᴜᴘsᴄ
││ • .sᴇʟғ
││ • .sᴄ
││ • .sᴇᴛ
││ • .ᴘᴜʙʟɪᴄ
││ • .ɢᴄᴏɴʟʏ
││ • .ɢᴇᴛᴄᴀsᴇ
││ • .ᴀᴜᴛᴏᴠɪᴇᴡsᴡ
││ • .ᴀᴅᴅᴏᴡɴᴇʀ
││ • .ᴀᴅᴅᴄᴀsᴇ
││ • .ᴅᴇʟᴄᴀsᴇ
││ • .ᴅᴇʟᴏᴡɴᴇʀ
││ • .ʟɪsᴛᴏᴡɴᴇʀ
││ • .ᴏᴡɴᴇʀ
││ • .sᴇᴛᴄᴍᴅ
││ • .ᴅᴇʟᴄᴍᴅ
│└───────────────
│
│┌─⊷ ɢʀᴏᴜᴘ ᴍᴀɴᴀɢᴇʀ
││ • .ʙᴜᴋᴀ
││ • .ᴛᴜᴛᴜᴘ
││ • .ᴘᴇɴɢᴜᴍᴜᴍᴀɴ
││ • .ᴘʀᴏᴍᴏᴛᴇ
││ • .ᴅᴇᴍᴏᴛᴇ
││ • .ᴅᴇʟᴇᴛᴇ
││ • .ᴋɪᴄᴋ
││ • .ʜɪᴅᴇᴛᴀɢ
│└───────────────
│
│┌─⊷ ᴅᴏᴡɴʟᴏᴀᴅ ᴍᴇɴᴜ
││ • .ᴍᴇᴅɪᴀғɪʀᴇ
││ • .ᴛɪᴋᴛᴏᴋ
││ • .ɪɴsᴛᴀɢʀᴀᴍ
││ • .ᴘʟᴀʏ
││ • .ʏᴛᴍᴘ3
││ • .ʏᴛᴍᴘ4
│└───────────────
│
│┌─⊷ sᴛᴏʀᴇ ᴍᴀɴᴀɢᴇʀ
││ • .ᴛᴇsᴛɪᴍᴏɴɪ
││ • .ᴘᴀʏᴍᴇɴᴛ
││ • .ᴅᴀɴᴀ
││ • .ɢᴏᴘᴀʏ
││ • .ᴏᴠᴏ
││ • .ǫʀɪs
│└───────────────
│
│┌─⊷ sᴛɪᴄᴋᴇʀ & ᴛᴏᴏʟs
││ • .ʙʀᴀᴛ
││ • .ʙʀᴀᴛɴɪᴍᴇ
││ • .ǫᴄ
││ • .ǫᴄ2
││ • .sᴛʏʟᴇ
││ • .sᴛɪᴄᴋᴇʀ
││ • .ʜᴅ
││ • .ɪǫᴄ
││ • .sᴜᴘᴇʀʜᴅ
││ • .ᴛᴏᴜʀʟ
││ • .ʀᴇᴀᴄᴛᴄʜ
││ • .ʀᴇᴍᴏᴠᴇʙɢ
││ • .ᴘɪɴ
││ • .ᴛᴏᴀɴɪᴍᴇ
│└───────────────
└────`;

await neo.sendMessage(m.chat, { document: fs.readFileSync("./package.json"), fileName: "ʜᴀɪᴅᴀʀ ʀᴠx", mimetype: 'application/vnd.openxmlformats-officedocument.spreadsheetml.sheet', fileLength: 99999999, viewOnce: true, caption: fullMessage, headerType: 1, quoted: m, contextInfo: { isForwarded: true, mentionedJid: [m.sender], forwardedNewsletterMessageInfo: { newsletterJid: '120363398785368583@newsletter', newsletterName: global.namach }, externalAdReply: { title: global.botname, body: `ᴠᴇʀsɪ ${global.versi}`, thumbnailUrl: global.imgmenu, sourceUrl: global.ytname, mediaType: 1, renderLargerThumbnail: true } } }); };